[net]
input_dim=512
classes=21
channels=3

# 0
[convolutional]
batch_normalize=True
bias=False
filters=16
size=3
stride=1
pad=1
activation=leaky

# 1
[dropblock]
name=dropblock-reg-1
block_size=7
target_keep_prob=0.8
init_keep_prob=1

# +++ downsample

# 2
[convolutional]
batch_normalize=True
bias=False
filters=32
size=3
stride=2
pad=1
activation=leaky

# 3
[convolutional]
batch_normalize=True
bias=False
filters=32
size=1
stride=1
pad=0
activation=leaky

# 4
[convolutional]
batch_normalize=True
bias=False
filters=32
size=3
stride=1
pad=1
activation=leaky

# 5
[shortcut]
from=-3
activation=linear

# +++ downsample

# 6
[convolutional]
batch_normalize=True
bias=False
filters=64
size=3
stride=2
pad=1
activation=leaky

# 7
[convolutional]
batch_normalize=True
bias=False
filters=64
size=1
stride=1
pad=0
activation=leaky

# 8
[convolutional]
batch_normalize=True
bias=False
filters=64
size=3
stride=1
pad=1
activation=leaky

# 9
[shortcut]
from=-3
activation=linear

# +++ downsample

# 10
[convolutional]
batch_normalize=True
bias=False
filters=128
size=3
stride=2
pad=1
activation=leaky

# 11
[convolutional]
batch_normalize=True
bias=False
filters=128
size=1
stride=1
pad=0
activation=leaky

# 12
[convolutional]
batch_normalize=True
bias=False
filters=128
size=3
stride=1
pad=1
activation=leaky

# 13
[shortcut]
from=-3
activation=linear

# +++ downsample

# 14
[convolutional]
batch_normalize=True
bias=False
filters=256
size=3
stride=2
pad=1
activation=leaky

# 15
[convolutional]
batch_normalize=True
bias=False
filters=256
size=1
stride=1
pad=0
activation=leaky

# 16
[convolutional]
batch_normalize=True
bias=False
filters=256
size=3
stride=1
pad=1
activation=leaky

# 17
[shortcut]
from=-3
activation=linear

# +++ downsample

# 18
[convolutional]
batch_normalize=True
bias=False
filters=512
size=3
stride=2
pad=1
activation=leaky

# 19
[convolutional]
batch_normalize=True
bias=False
filters=512
size=1
stride=1
pad=0
activation=leaky

# 20
[convolutional]
batch_normalize=True
bias=False
filters=512
size=3
stride=1
pad=1
activation=leaky

# 21
[shortcut]
from=-3
activation=linear

# +++ downsample

# 22
[convolutional]
batch_normalize=True
bias=False
filters=1024
size=3
stride=2
pad=1
activation=leaky

# 23
[convolutional]
batch_normalize=True
bias=False
filters=1024
size=1
stride=1
pad=0
activation=leaky

# 24
[convolutional]
batch_normalize=True
bias=False
filters=1024
size=3
stride=1
pad=1
activation=leaky

# 25
[shortcut]
from=-3
activation=linear

# +++ moar convolution

# 26
[convolutional]
batch_normalize=True
bias=False
filters=1024
size=3
stride=1
pad=1
activation=leaky

# 27
[convolutional]
batch_normalize=True
bias=False
filters=512
size=1
stride=1
pad=0
activation=leaky

# 28
[convolutional]
batch_normalize=True
bias=False
filters=1024
size=3
stride=1
pad=1
activation=leaky

# 29
[shortcut]
from=-3
activation=linear

# +++ FIRST DETECTION BRANCH

# 30
[convolutional]
batch_normalize=True
bias=False
filters=512
size=1
stride=1
pad=0
activation=leaky

# 31
[convolutional]
batch_normalize=True
bias=False
filters=1024
size=3
stride=1
pad=1
activation=leaky

# 32
[convolutional]
batch_normalize=True
bias=False
filters=512
size=1
stride=1
pad=0
activation=leaky

# 33
[convolutional]
batch_normalize=True
bias=False
filters=1024
size=3
stride=1
pad=1
activation=leaky

# 34
[conv-pre-yolo]

# 35
[detection]
mask = 3,4,5
anchors = 13,16  37,66  55,159  118,103  91,244  198,169
ignore_thresh = .7
lambda_bbox = 1.0
lambda_noobj = 100.0
lambda_obj = 1.0
lambda_cls = 1.0

# +++ BACK BONE - STITCHING DATA STREAMS

# 36
[route]
layers = 29

# 37
[convolutional]
batch_normalize=True
bias=False
filters=256
size=1
stride=1
pad=0
activation=leaky

# 38
[upsample]
stride=2

# 39
[route]
layers = -1, 21

# +++ SECOND DETECTION BRANCH

# 40
[convolutional]
batch_normalize=True
bias=False
filters=256
size=1
stride=1
pad=0
activation=leaky

# 41
[convolutional]
batch_normalize=True
bias=False
filters=512
size=3
stride=1
pad=1
activation=leaky

# 42
[convolutional]
batch_normalize=True
bias=False
filters=256
size=1
stride=1
pad=0
activation=leaky

# 43
[convolutional]
batch_normalize=True
bias=False
filters=512
size=3
stride=1
pad=1
activation=leaky

# 44
[conv-pre-yolo]

# 45
[detection]
mask = 0,1,2
anchors = 13,16  37,66  55,159  118,103  91,244  198,169
ignore_thresh = .7
lambda_bbox = 1.0
lambda_noobj = 100.0
lambda_obj = 1.0
lambda_cls = 1.0